MAPWRITE DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,TIOAPFX=YES

MAP1     DFHMDI SIZE=(24,80),LINE=01,COLUMN=01,CTRL=(PRINT,FREEKB)
         DFHMDF POS=(5,10),ATTRB=(UNPROT,IC),LENGTH=3,FIELD=KEYIN
         DFHMDF POS=(7,10),ATTRB=(UNPROT),LENGTH=10,FIELD=CDECLT

MAP3     DFHMDI SIZE=(24,80),LINE=01,COLUMN=01,CTRL=(PRINT,FREEKB)
         DFHMDF POS=(12,20),ATTRB=(PROT,BRIGHT),LENGTH=40,FIELD=MSGINFO

MAPWRITE DFHMSD TYPE=FINAL
         END
