       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGFINAL.
       AUTHOR. E NGBAME.
      *********************************************************
      *        CE PROGRAMME FAIT LE CRUD DEPUIS LA MAP.       *
      *********************************************************
      
