       IDENTIFICATION DIVISION. 
       PROGRAM-ID. HellowWorld.
       AUTHOR. Emmanuel.
       DATE-WRITTEN. 2024-06-15.

       PROCEDURE DIVISION.
           DISPLAY "Bonjour à tous".

           STOP RUN.
            