//EXORUN  JOB EXORUN,'EXORUN',MSGLEVEL=(1,1),REGION=4M,
//           MSGCLASS=A,CLASS=A,NOTIFY=&SYSUID
//*---------------------------------------------
//*EXECUTION PROGRAMME AFFICHAGE PG18CH12
//*---------------------------------------------
//STEPTEST EXEC PGM=PG18CH12
//STEPLIB  DD DSN=FORM1011.COBOL.LOAD,DISP=SHR
//FCLTDD   DD DSN=VOTRE.FICHIER.CLIENT,DISP=SHR
//PRCLTDD  DD SYSOUT=C
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
/*
//